gateway/src/test/artillery/gateway.yml
config:
  target: "http://localhost:28082"
  phases:
    - duration: 1
      arrivalRate: 1
      maxVusers: 1
  http:
    timeout: 10
  environments:
    localhost-direct-single:
      target: "http://localhost:28082"
      phases:
        - duration: 1
          arrivalRate: 1
          maxVusers: 1
scenarios:
  - name: Login and request resource
    flow:
      - post:
          url: "/auth"
          json:
            username: good
            authenticated: true
          headers:
            Accept: application/json
            Content-Type: application/json
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - log: "{{refresh_token}}"
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 200
      - post:
          url: "/refresh"
          form:
            refresh_token: "{{ refresh_token }}"
            grant_type: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 200
      - post:
          url: "/logout"
          form:
            refresh_token: "{{ refresh_token }}"
            token_type: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          expect:
            - statusCode: 200